app/views/pages/order_success.html.erb

                            <span style="font-size:20px;text-transform: uppercase;">Order ID# <%= @order.id -%></span><br/>
                            <% @order.order_items.each do |li| %>
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 254