app/views/order_mailer/order_confirmation.html.erb

                                            <table border="0" cellpadding="0" cellspacing="0" width="78%">
                                                <tbody><tr><td align="center" style="font-family:'Open Sans',arial,sans-serif!important;font-size:16px!important;line-height:30px!important;font-weight:400!important;color:rgb(126,136,144)!important"><% @order.order_items.each do |li| %>
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` IN (246, 247, 248, 249, 250)