app/controllers/orders_controller.rb

INSERT INTO `orders` (`user_id`, `created_at`, `updated_at`, `user_level_id`) VALUES (2, '2017-09-12 10:22:49', '2017-09-12 10:22:49', 8)
---
  def create
    @order = current_user.orders.build order_params
    sanitize_order

    if @order.save