app/controllers/pages_controller.rb

  def order_success
    @order = Order.where(id: params[:order_id]).first
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 254 ORDER BY `orders`.`id` ASC LIMIT 1