app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'piyushshivam@gmail.com' LIMIT 1

  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE `users` SET `encrypted_password` = '$2a$11$a1EXRvkQUR4iHTZlGv4xh.dCIWwW3mIeZWGzDMqlULbWeX7Kg9y.u', `updated_at` = '2017-09-11 23:34:31' WHERE `users`.`id` = 2